# -*- coding:utf-8 -*-
from tkinter import *
def get_mbti_code():
    return ["INTJ","INTP","ENTJ","ENTP",
            "INFJ","INFP","ENFJ","ENFP",
            "ISTJ","ISFJ","ESTJ","ESFJ",
            "ISTP","ISFP","ESTP","ESFP"
            ]
    
def get_mbti_info():
    I = {"title":"Introvert",   "data":"จะมีการใช้พลังงานและใช้เวลาไปกับสิ่งภายในตัวเอง"}
    E = {"title":"Extrovert",   "data":"จะมีการใช้พลังงานและรับพลังงานบวกไปกับสิ่งภายนอก"}
    N = {"title":"iNtuition",   "data":"ถนัดการรับรู้ในภาพรวม ความหมายที่ซ่อนอยู่ ความสัมพันธ์ของสิ่งต่าง ๆ"}
    S = {"title":"Sensing",     "data":"ถนัดการรับข้อมูลที่เกี่ยวกับข้อเท็จจริง จากประสาทสัมผัสทั้ง 5 เช่นการมอง การฟัง"}
    T = {"title":"Thinking",    "data":"มักตัดสินใจจากเหตุและผล ให้ความสำคัญเกี่ยวกับข้อเท็จจริง"}
    F = {"title":"Feeling",     "data":"มักตัดสินใจหรือนำมาสู่ข้อสรุป จากคุณค่าความสำคัญ หรือคุณค่าที่สังคมให้ความสำคัญ"}
    J = {"title":"Judging",     "data":"ถนัดในการรับมือโดยอาศัยการวางแผน ความแม่นยำ การจัดตารางเวลา"}
    P = {"title":"Perceiving",  "data":"การรับมือโดยอาศัยความยืดหยุ่น ชอบความเปิดกว้าง เปิดรับสิ่งใหม่ ๆ"}
    return {"INTJ":f"""INTJ “นักออกแบบ”\nบุคลิกภาพที่หายากที่สุดเป็นอันดับสอง มีสัดส่วนเพียง 2% จากประชากรทั้งหมด\nคนที่มีบุคลิกภาพแบบนักออกแบบนั้นช่างจินตนาการ แต่ก็เด็ดขาด มีความทะเยอทะยาน\nแต่ก็รักในความเป็นส่วนตัว มีความสงสัยใคร่รู้ แต่ก็ไม่ใช้พลังงานตัวเองไปอย่างสิ้นเปลือง\n[ {I['title']} ] {I['data']}\n[ {N['title']} ] {N['data']}\n[ {T['title']} ] {T['data']}\n[ {J['title']} ] {J['data']}""",
            "INTP":f"""INTP “นักตรรกะ”\nบุคลิกภาพพบได้ยากยิ่ง มีอยู่เพียง 3% จากประชากรทั้งหมด\nซึ่งเป็นเรื่องดีสำหรับพวกเขา เพราะไม่มีอะไรน่าเศร้าไปกว่าการ “เหมือน” กับคนอื่น ๆ\nนักตรรกะภูมิใจในความช่างคิดของตนเอง มีมุมมองที่ไม่เหมือนใครและความเฉลียวฉลาด \n[ {I['title']} ] {I['data']}\n[ {N['title']} ] {N['data']}\n[ {T['title']} ] {T['data']} \n[ {P['title']} ] {P['data']}""",
            "ENTJ":f"""ENTJ “ผู้บัญชาการ”\nเป็นผู้นำโดยแต่กำเนิด มีเสน่ห์และความมั่นใจเป็นพรสวรรค์\nและมีอำนาจที่ชักจูงฝูงชนจะขับเคลื่อนเป้าหมายให้สำเร็จ มีความเป็นเหตุเป็นผลที่เฉียบขาด\n ความมุ่งมั่น และปัญญาที่เฉียบแหลม ก็เป็นเรื่องที่ดีที่มีคนประเภทนี้เพียง 3% ของประชากรทั้งหมด\n[ {E['title']} ] {E['data']}\n[ {N['title']} ] {N['data']}\n[ {T['title']} ] {T['data']}\n[ {J['title']} ] {J['data']}""",
            "ENTP":f"""ENTP “นักโต้วาที”\nนักโต้วาทีนั้นเป็นนักโต้แย้งสูงสุด มีความอุสาหะที่จะขยี้ข้อโต้แย้ง ความเชื่อ ให้แตกออกเป็นส่วน ๆ\nและปล่อยให้ทุกคนได้เห็นเศษซากที่หลงเหลืออยู่ เพราะมันเป็นโอกาสที่ได้ฝึกเชาว์ปัญญา\nสั่งสมความรู้ และเพิ่มพูนความสามารถในการเก็บข้อมูลต่าง ๆ\n[ {E['title']} ] {E['data']}\n[ {N['title']} ] {N['data']}\n[ {T['title']} ] {T['data']}\n[ {P['title']} ] {P['data']}""",
            
            "INFJ":f"""INFJ “ผู้แนะนำ”\nบุคลิกภาพที่หายากที่สุด มีน้อยกว่า 1% ของประชากรทั้งหมด\nพวกเขามีความคิดแบบอุดมคตินิยม สิ่งที่แตกต่างจากบุคลิกภาพแบบอุดมคติแบบอื่น ๆ\nคือความเด็ดขาด และความมุ่งมั่น ผู้แนะนำไม่ใช่คนช่างฝัน แต่เป็นคนที่สามารถก้าวตามแนวทาง\nอย่างมั่นคงเพื่อให้บรรลุเป้าหมาย และสร้างผลกระทบด้านบวก\n[ {I['title']} ] {I['data']}\n[ {N['title']} ] {N['data']}\n[ {F['title']} ] {F['data']}\n[ {J['title']} ] {J['data']}""",
            "INFP":f"""INFP “ผู้ไกล่เกลี่ย”\nมีประชากรเพียง 4% เท่านั้นที่เป็นผู้ไกล่เกลี่ย และเป็นผู้ยึดมั่นในอุดมการณ์อย่างแท้จริง\nมักจะมองหาร่องรอยเล็กน้อยของความดีในคนไม่ดีหรือสถานการณ์ย่ำแย่ มองหาทางที่จะทำให้ดีขึ้น\nแม้ว่าจะถูกมองว่าเป็นคนสุขุม เก็บตัว หรือเขินอาย และมีความเสี่ยงที่จะถูกเข้าใจผิดอยู่มาก\nแต่พวกเขาเป็นกลุ่มคนที่คนอยากใช้เวลาด้วย\n[ {I['title']} ] {I['data']}\n[ {N['title']} ] {N['data']}  \n[ {F['title']} ] {F['data']}\n[ {P['title']} ] {P['data']}""",
            "ENFJ":f"""ENFJ “ตัวเอก”\nบุคลิกภาพนี้เกิดมาเป็นผู้นำโดยธรรมชาติ เปี่ยมไปด้วยความมุ่งมั่นและเสน่ห์ มีอยู่ประมาณ 2%\nบุคลิกภาพนี้มักเป็นนักการเมือง โค้ช หรือครูของพวกเรา\nทำหน้าที่สร้างแรงบันดาลใจให้แก่ผู้อื่นบรรลุเป้าหมายและทำสิ่งดี ๆ ด้วยความมั่นใจที่เป็นธรรมชาติ\nและพอใจเป็นอย่างมากเมื่อได้นำทางผู้อื่นให้พัฒนาตนเองหรือชุมชนของตนเอง\n[ {E['title']} ] {E['data']}\n[ {N['title']} ] {N['data']}\n[ {F['title']} ] {F['data']}\n[ {J['title']} ] {J['data']}""",
            "ENFP":f"""ENFP “นักรณรงค์”\nบุคลิกภาพที่รักอิสระอย่างแท้จริง สัดส่วน 7% ของประชากร พวกเขามักเป็นหัวใจของงานปาร์ตี้\nแต่พวกเขาไม่ได้สนใจความตื่นเต้นหรือความสุขที่เกิดขึ้น ณ ขณะนั้นมากเท่ากับการได้เข้าสังคม\nและการปฏิสัมพันธ์ทางอารมณ์กับผู้อื่น มีเสน่ห์ เป็นอิสระ มีพลัง และเห็นอกเห็นใจคนอื่น\nนอกเหนือจากที่เป็นคนชอบเข้าสังคม แล้วยังมีวิสัยทัศน์โดยธรรมชาติ\n[ {E['title']} ] {E['data']}\n[ {N['title']} ] {N['data']}  \n[ {F['title']} ] {F['data']}\n[ {P['title']} ] {P['data']}""",
            
            "ISTJ":f"""ISTJ “นักคำนวณ”\nมีอยู่ในประชากรนับเป็นสัดส่วนมากที่สุดถึง 13% ความเถรตรงและตรรกะเชิงปฏิบัติ\nและการทุ่มเทอย่างไม่อ่อนกำลังต่อหน้าที่ ทำให้นักคำนวณเป็นหลักกำลังสำคัญ\nยึดตามกฎเกณฑ์และมาตรฐาน และจะทำงานทั้งหมดอย่างเที่ยงตรงถูกต้องอย่างอดทน\nไม่ชอบการคาดเดาแต่ชอบที่จะวิเคราะห์สิ่งแวดล้อมรอบข้าง ตรวจสอบข้อเท็จจริง\nและสรุปรวมเป็นสิ่งที่ควรปฏิบัติ\n[ {I['title']} ] {I['data']}\n[ {S['title']} ] {S['data']} \n[ {T['title']} ] {T['data']}\n[ {J['title']} ] {J['data']}""",
            "ISFJ":f"""ISFJ “ผู้ตั้งรับ”\nบุคลิกภาพแบบผู้ตั้งรับนั้นค่อนข้างมีเอกลักษณ์ เพราะลักษณะส่วนใหญ่ค่อนข้างเฉพาะตัว\nแม้ว่าจะมีความเมตตา แต่อาจโหดเหี้ยมเมื่อต้องปกป้องครอบครัวหรือเพื่อนฝูง \nแม้ว่าจะเป็นคนเงียบ ๆ พวกเขามักเป็นคนที่เข้าสังคมได้ดีและเป็นมิตร\nและแม้ว่าจะชอบความมั่นคง บุคลิกภาพประเภทนี้เปิดกว้างกับการเปลี่ยนแปลง\nตราบใดที่รู้สึกว่ามีคนเข้าใจและได้รับความเคารพ\n[ {I['title']} ] {I['data']}\n[ {S['title']} ] {S['data']}\n[ {F['title']} ] {F['data']}\n[ {J['title']} ] {J['data']}""",
            "ESTJ":f"""ESTJ “ผู้บริหาร”\nตัวแทนของขนบประเพณีและระเบียบขั้นตอน ให้ความเข้าใจว่าอะไรคือสิ่งที่เหมาะสมถูกต้อง\nอะไรคือสิ่งที่ผิดและอะไรคือสิ่งที่สังคมยอมรับได้ มาทำให้สังคมสามัคคีกัน ให้คุณค่ากับความซื่อสัตย์\nความทุ่มเท และเกียรติยศ คนที่มีบุคลิกภาพแบบผู้บริหารนั้น มักจะให้คำแนะนำที่ชัดเจน\nและชอบที่จะเป็นผู้นำในสถานการณ์ที่ยากลำบาก\n[ {E['title']} ] {E['data']}\n[ {S['title']} ] {S['data']}  \n[ {T['title']} ] {T['data']}\n[ {J['title']} ] {J['data']}""",
            "ESFJ":f"""ESFJ “ผู้ให้คำปรึกษา”\nมักจะเป็นที่นิยม ซึ่งก็เป็นเรื่องที่เข้าใจได้ เพราะเป็นบุคลิกภาพที่พบได้มาก\nมีสัดส่วนกว่า 12% และในโรงเรียน ผู้ให้คำปรึกษาจะเป็นเชียร์ลีดเดอร์เป็นคนกำหนดอารมณ์ \nอยู่ในความสนใจ และนำทีมของพวกเขาสู่ความสำเร็จและชื่อเสียง เมื่อโตขึ้น ผู้ให้คำปรึกษา\nจะคงยังชื่นชอบที่จะสนับสนุนเพื่อน ๆ และคนที่รัก ทำหน้าที่จัดงานชุมนุมของชุมชน\nและทำอย่างเต็มที่เพื่อให้แน่ใจว่าทุกคนมีความสุข\n[ {E['title']} ] {E['data']}\n[ {S['title']} ] {S['data']}\n[ {F['title']} ] {F['data']}\n[ {J['title']} ] {J['data']}""",
            
            "ISTP":f"""ISTP “ผู้เชี่ยวชาญด้านศิลปะ”\nชอบสำรวจด้วยตัวเอง สัมผัสและพิจารณาโลกรอบตัวด้วยเหตุผลอย่างใจเย็น\nและความสงสัยใคร่รู้ คนที่มีบุคลิกภาพเช่นนี้เป็นนักปฏิบัติโดยธรรมชาติ\nเรียนรู้จากสิ่งแวดล้อมได้ดี พบได้มากในช่างเครื่องและวิศวกร และชื่นชอบลงมือทำ\nบุคลิกภาพนี้สำรวจแนวความคิดผ่านการสร้าง แก้ปัญหา ทดลอง \nและความผิดพลาด จากการลงมือทำโดยตรง\n[ {I['title']} ] {I['data']}\n[ {N['title']} ] {N['data']}\n[ {T['title']} ] {T['data']} \n[ {P['title']} ] {P['data']}""",
            "ISFP":f"""ISFP “นักผจญภัย”\nเป็นบุคลิกภาพที่เป็นศิลปินเต็มตัว แต่ไม่ได้หมายถึงว่าจะต้องเป็นนักวาดรูปขีดเขียน\nอย่างที่เข้าใจกัน แต่บ่อยครั้งพวกเขาก็สามารถทำเช่นนั้นได้ดี แม้แต่กับการตัดสินใจ\nลงมือทำเพื่อก้าวข้ามข้อจำกัดต่าง ๆ และใช้ชีวิตอย่างมีสีสันออกรสชาติ\nซึ่งได้แรงบันดาลใจมาจากการปฏิสัมพันธ์กับผู้อื่น และแนวความคิดต่าง ๆ\n[ {I['title']} ] {I['data']}\n[ {S['title']} ] {S['data']}  \n[ {F['title']} ] {F['data']}\n[ {P['title']} ] {P['data']}""",
            "ESTP":f"""ESTP “ผู้ประกอบการ”\nมักมีอิทธิพลแผ่ไปถึงคนใกล้ตัว วิธีที่ง่ายที่สุดที่จะมองหาคนประเภทนี้ในงานปาร์ตี้\nนั้นคือการมองหากลุ่มคนที่เกาะกลุ่มอยู่รอบ ๆ ด้วยอารมณ์ขัน และความสามารถ\nในการสร้างความบันเทิง บุคลิกภาพผู้ประกอบการชื่นชอบ ที่จะเป็นศูนย์กลาง\nของความสนใจ มีสไตล์การใช้ชีวิตแบบสุ่มเสี่ยง พวกเขาใช้ชีวิตกับปัจจุบัน\nและลงมือทำ มีความสงบนิ่งท่ามกลางความวุ่นวายได้เป็นอย่างดี\n[ {E['title']} ] {E['data']}\n[ {N['title']} ] {N['data']}\n[ {T['title']} ] {T['data']} \n[ {P['title']} ] {P['data']}""",
            "ESFP":f"""ESFP “ผู้มอบความบันเทิง”\nผู้มอบความบันเทิงมักตกอยู่ในภวังค์ของความตื่นเต้น ณ ขณะนั้น และต้องการให้ทุกคน\nรู้สึกแบบเดียวกัน ไม่มีบุคลิกภาพอื่นใดแล้วที่จะใจดีมอบเวลาและพลังงานให้กับผู้อื่นได้เท่า\nผู้มอบความบันเทิง ทุกแห่งคือเวทีสำหรับพวกเขา มีทักษะทางสังคมสูง \nผู้มอบความบันเทิงนั้นมีความสุขได้อย่างเรียบง่าย\n[ {E['title']} ] {E['data']}\n[ {S['title']} ] {S['data']}  \n[ {F['title']} ] {F['data']}\n[ {P['title']} ] {P['data']}"""
            }
def get_quiz_TH():
     return [["IE","คุณมักพบกว่าเป็นเรื่องไม่ยากที่จะผ่อนคลาย\nเมื่อต้องพูดต่อหน้าคนจำนวนมาก"],
            ["IE","ในหมู่เพื่อนของคุณ คุณคือคนแบบไหน ?"],
            ["IE","เมื่อคุณพบปะเพื่อนใหม่ คุณจะบอกความสนใจ\nหรืองานอดิเรกในตอน.."],
            ["IE","การแสดงออกทางอารมณ์ของคุณมักจะเป็นแบบไหน ?"],
            ["IE","คุณมักกังวลใจในการตกเป็นจุดสนใจของคนอื่น ๆ ?"],
            ["IE","รูปแบบของคุณเมื่ออยู่กับกลุ่มคนสนทนา เป็นแบบไหน ?"],
            ["IE","โดยปกติแล้วคุณมักจะ.."],
            #
            ["NS","คุณคิดว่าความคิดเห็นของผู้อื่นนั้นควรได้รับการพิจารณา\nหรือนำมาวิเคราะห์ไม่ว่าความคิดเห็นนั้น\nจะไม่มีข้อเท็จจริงมารองรับก็ตาม ?"],
            ["NS","เมื่อคุณพบเจอกับปัญหา \nที่อาจจะมีหลาย ๆ คนประสบคุณจะแก้ไขปัญหาแบบไหน ?"],
            ["NS","คุณคิดว่าคุณนั้นเป็นคนมีเป็นมีแนวคิดและวิธีการแบบไหน ?"],
            ["NS","คุณมักใช้เวลาศึกษาแนวความคิดที่ยังไม่เป็นจริง\nหรือยังไม่ดำเนินการได้แต่มีความน่าสนใจ "],
            ["NS","คุณมักจะเข้ากันได้ดีกับเพื่อนที่มีลักษณะนิสัยแบบไหน ?"],
            ["NS","คุณแทบไม่เคยหลงไหลไปกับเรื่องแฟนตาซี หนังหรือแนวคิดใด ๆ"],
            ["NS","การทำงานการใช้ความคิดหรือการแก้ไขปัญหาแล้ว \nคุณจะคิดถึงอะไรระหว่าง.."],
            #
            ["FT","คำชมของคนอื่นแบบไหน\nที่คุณรู้สึกว่าชื่นชอบมากกว่ากันระหว่าง.."],
            ["FT","โดยปกติแล้วคุณนั้นเป็นคนแบบไหน ระหว่าง.."],
            ["FT","คุณมักจะกังวลมากเกินไปว่าคนอื่นคิดอย่างไรในการกระทำตัวเอง ?"],
            ["FT","หากมีการโต้แย้งหรือถกเถียงกันในกลุ่ม คุณจะทำอย่างไร ?"],
            ["FT","แทบไม่เคยมีใครทำให้คุณอารมณ์เสียได้ ?"],
            ["FT","บ่อยครั้งเป็นเรื่องยากที่คุณจะเข้าใจความรู้สึกของผู้อื่น ?"],
            ["FT","หากเพื่อนของคุณกำลังเศร้า คุณมักทำอย่างไร ?"],
            #
            ["PJ","เมื่อคุณหรือเพื่อน ๆ ของคุณจะไปเที่ยวกันคุณจะทำอย่างไร ?"],
            ["PJ","หากว่าคุณมีจะทำงาน รูปแบบในการทำงานคุณจะเป็นแบบไหน ?"],
            ["PJ","การมีทางเลือกหลายทางนั้นสำคัญกว่ามีรายการสิ่งที่ต้องทำ"],
            ["PJ","คุณมักจะประสบผลสำเร็จในการทำงานรูปแบบไหน ?"],
            ["PJ","คุณชอบที่จะ.."],
            ["PJ","เมื่อมีการนัดแนะกันล่วงหน้าเพื่อทำบางสิ่งในเวลาที่นัดแน่นอน \nคุณรู้สึกอย่างไร ?"],
            ["PJ","คุณจะเลือกอะไรในสองสิ่งนี้.."]    
]
    
def get_answer_TH():    
    return [["E","I","เห็นด้วย","ไม่เห็นด้วย"],
            ["I","E","คนสุดท้ายที่จะรู้เรื่องราวภายในกลุ่ม","รับรู้ข่าวสารของเพื่อนในกลุ่มอยู่ตลอด"],
            ["I","E","หลังจากที่ได้ทำความรู้จักจริง ๆ แล้ว","ตอนที่เจอกันเลย"],
            ["E","I","แสดงความรู้สึกออกมาอย่างเต็มที่","เก็บความรู้สึกไว้กับตัวเอง ไม่แสดงมากนัก"],
            ["I","E","เห็นด้วย","ไม่เห็นด้วย"],
            ["I","E","ยืนดูท่าทีอยู่หลัง ๆ และฟังวงสนทนาก่อน","เข้าร่วมวงสนทนาด้วยอย่างเหมาะสม"],
            ["E","I","สามารถเข้ากับคนอื่น ๆ ได้ดี","ค่อนข้างเงียบและไม่สุงสิง"],
            #
            ["N","S","เห็นด้วย","ไม่เห็นด้วย"],
            ["N","S","คิดค้นวิธีการแก้ไขปัญหาขึ้นมาเอง","ด้วยวิธีที่มีการแก้ไขมาก่อนแล้วและเป็นที่ยอมรับ"],
            ["S","N","คนที่นำหลักการมาปรับใช้ได้อย่างดี ปฏิบัติเก่ง","คนที่คิดนอกกรอบ สร้างสรรค์\nไม่ยึดติดตามหลักการ"],
            ["N","S","เห็นด้วย หลักการแนวคิดใหม่ ๆ น่าค้นหา","ไม่เห็นด้วย ศึกษาสิ่งที่มีให้เชี่ยวชาญน่าสนใจกว่า"],
            ["S","N","คนที่ยึดหลักความเป็นจริง เป็นรูปธรรม","คนที่มีจินตนาการ ความคิดสร้างสรรค์"],
            ["S","N","ใช่ ของเหล่านั้นไม่ค่อยมีผลอะไรกับฉันมาก","ไม่ ฉันชื่นชอบในแฟนตาซีและแนวคิดต่าง ๆ"],
            ["S","N","ข้อเท็จจริง","หลักการ"],
            #
            ["F","T","คุณเป็นคนมีความจริงใจ ซื่อตรงและน่าคบหา","คุณเป็นคนที่มีเหตุผล และสม่ำเสมอ"],
            ["T","F","ใช้ตรรกะเหตุผล\nมากกว่าความรู้สึกและความเห็นอกเห็นใจ","ใช้ความรู้สึกและความเห็นอกเห็นใจ\nมากกว่าตรรกะเหตุผล"],
            ["F","T","เห็นด้วย","ไม่เห็นด้วย"],
            ["T","F","โต้แย้งให้ชนะ สำคัญมากกว่า","ใส่ใจความรู้สึกผู้อื่น สำคัญมากกว่า"],
            ["F","T","ไม่ มีอารมณ์เสียบ้างมาจากความอึดอัดใจ","ใช่ เพราะต้องดูที่เหตุผลของการกระทำนั้น ๆ"],
            ["T","F","ใช่ บางคนก็จะซับซ้อนกว่าที่คิด","ไม่นะ เพราะเราสามารถเอาใจเขามาใส่ใจเราได้"],
            ["F","T","ปลอบประโลมเพื่อนที่ทุกใจ","เสนอทางออกในการแก้ปัญหา"],
            #
            ["J","P","งั้นเรามาวางแผนกันว่าจะทำอะไรบ้าง ไปวันไหน","ไปกันเลย ลุย!!"],
            ["P","J","เริ่มทำงานได้เลยโดยจัดการปัญหา\nไปพร้อม ๆ กันได้","วางแผนอย่างเป็นระบบก่อนเริ่มทำงาน\nเพื่อให้ความกดดันน้อยลง"],
            ["P","J","เห็นด้วย","ไม่เห็นด้วย"],
            ["J","P","ทำงานเป็นไปตามแผนอย่างระมัดระวัง รอบคอบ","ทำงานพร้อมรับมือกับเหตุการณ์\nไม่คาดคิดได้อยู่เสมอ"],
            ["J","P","ไปเที่ยว จัดปิกนิก ปาร์ตี้ ฯลฯ ล่วงหน้า","มีอิสระที่จะทำอะไรก็ได้ที่ดูสนุก เมื่อเวลามาถึง"],
            ["J","P","พึงพอใจที่สามารถวางแผนได้อย่างเหมาะสม","ไม่พอใจเล็กน้อยที่กำหนดไว้ตายตัว ไม่ยืดหยุ่น"],
            ["P","J","เป็นไปตามธรรมชาติ ตามสัญชาตญาณ","เป็นระบบระเบียบ ตามแนวปฏิบัติ"]    
]
    

infodict = get_mbti_info()
root = Tk()
root.geometry("900x600")
frame = LabelFrame(root)
frame.pack(expand=1, fill=BOTH)
Label(frame, text=infodict[info], font="leelawadee 14 bold", justify=LEFT,bg="lightblue").pack(expand=1, fill=BOTH)

root.mainloop()