def get_MbtiQuizTH():
     return [["IE","คุณมักพบกว่าเป็นเรื่องไม่ยากที่จะผ่อนคลาย\nเมื่อต้องพูดต่อหน้าคนจำนวนมาก"],
            ["IE","ในหมู่เพื่อนของคุณ คุณคือคนแบบไหน ?"],
            ["IE","เมื่อคุณพบปะเพื่อนใหม่ คุณจะบอกความสนใจ\nหรืองานอดิเรกในตอน.."],
            ["IE","การแสดงออกทางอารมณ์ของคุณมักจะเป็นแบบไหน ?"],
            ["IE","คุณมักกังวลใจในการตกเป็นจุดสนใจของคนอื่น ๆ ?"],
            ["IE","รูปแบบของคุณเมื่ออยู่กับกลุ่มคนสนทนา เป็นแบบไหน ?"],
            ["IE","โดยปกติแล้วคุณมักจะ.."],
            #
            ["NS","คุณคิดว่าความคิดเห็นของผู้อื่นนั้นควรได้รับการพิจารณา\nหรือนำมาวิเคราะห์ไม่ว่าความคิดเห็นนั้น\nจะไม่มีข้อเท็จจริงมารองรับก็ตาม ?"],
            ["NS","เมื่อคุณพบเจอกับปัญหา \nที่อาจจะมีหลาย ๆ คนประสบคุณจะแก้ไขปัญหาแบบไหน ?"],
            ["NS","คุณคิดว่าคุณนั้นเป็นคนมีเป็นมีแนวคิดและวิธีการแบบไหน ?"],
            ["NS","คุณมักใช้เวลาศึกษาแนวความคิดที่ยังไม่เป็นจริง\nหรือยังไม่ดำเนินการได้แต่มีความน่าสนใจ "],
            ["NS","คุณมักจะเข้ากันได้ดีกับเพื่อนที่มีลักษณะนิสัยแบบไหน ?"],
            ["NS","คุณแทบไม่เคยหลงไหลไปกับเรื่องแฟนตาซี หนังหรือแนวคิดใด ๆ"],
            ["NS","การทำงานการใช้ความคิดหรือการแก้ไขปัญหาแล้ว \nคุณจะคิดถึงอะไรระหว่าง.."],
            #
            ["FT","คำชมของคนอื่นแบบไหน\nที่คุณรู้สึกว่าชื่นชอบมากกว่ากันระหว่าง.."],
            ["FT","โดยปกติแล้วคุณนั้นเป็นคนแบบไหน ระหว่าง.."],
            ["FT","คุณมักจะกังวลมากเกินไปว่าคนอื่นคิดอย่างไรในการกระทำตัวเอง ?"],
            ["FT","หากมีการโต้แย้งหรือถกเถียงกันในกลุ่ม คุณจะทำอย่างไร ?"],
            ["FT","แทบไม่เคยมีใครทำให้คุณอารมณ์เสียได้ ?"],
            ["FT","บ่อยครั้งเป็นเรื่องยากที่คุณจะเข้าใจความรู้สึกของผู้อื่น ?"],
            ["FT","หากเพื่อนของคุณกำลังเศร้า คุณมักทำอย่างไร ?"],
            #
            ["PJ","เมื่อคุณหรือเพื่อน ๆ ของคุณจะไปเที่ยวกันคุณจะทำอย่างไร ?"],
            ["PJ","หากว่าคุณมีจะทำงาน รูปแบบในการทำงานคุณจะเป็นแบบไหน ?"],
            ["PJ","การมีทางเลือกหลายทางนั้นสำคัญกว่ามีรายการสิ่งที่ต้องทำ"],
            ["PJ","คุณมักจะประสบผลสำเร็จในการทำงานรูปแบบไหน ?"],
            ["PJ","คุณชอบที่จะ.."],
            ["PJ","เมื่อมีการนัดแนะกันล่วงหน้าเพื่อทำบางสิ่งในเวลาที่นัดแน่นอน \nคุณรู้สึกอย่างไร ?"],
            ["PJ","คุณจะเลือกอะไรในสองสิ่งนี้.."]    
]
    
def get_MbtiAnsTH():    
    return [["E","I","เห็นด้วย","ไม่เห็นด้วย"],
            ["I","E","คนสุดท้ายที่จะรู้เรื่องราวภายในกลุ่ม","รับรู้ข่าวสารของเพื่อนในกลุ่มอยู่ตลอด"],
            ["I","E","หลังจากที่ได้ทำความรู้จักจริง ๆ แล้ว","ตอนที่เจอกันเลย"],
            ["E","I","แสดงความรู้สึกออกมาอย่างเต็มที่","เก็บความรู้สึกไว้กับตัวเอง ไม่แสดงมากนัก"],
            ["I","E","เห็นด้วย","ไม่เห็นด้วย"],
            ["I","E","ยืนดูท่าทีอยู่หลัง ๆ และฟังวงสนทนาก่อน","เข้าร่วมวงสนทนาด้วยอย่างเหมาะสม"],
            ["E","I","สามารถเข้ากับคนอื่น ๆ ได้ดี","ค่อนข้างเงียบและไม่สุงสิง"],
            #
            ["N","S","เห็นด้วย","ไม่เห็นด้วย"],
            ["N","S","คิดค้นวิธีการแก้ไขปัญหาขึ้นมาเอง","ด้วยวิธีที่มีการแก้ไขมาก่อนแล้วและเป็นที่ยอมรับ"],
            ["S","N","คนที่นำหลักการมาปรับใช้ได้อย่างดี ปฏิบัติเก่ง","คนที่คิดนอกกรอบ สร้างสรรค์\nไม่ยึดติดตามหลักการ"],
            ["N","S","เห็นด้วย หลักการแนวคิดใหม่ ๆ น่าค้นหา","ไม่เห็นด้วย ศึกษาสิ่งที่มีให้เชี่ยวชาญน่าสนใจกว่า"],
            ["S","N","คนที่ยึดหลักความเป็นจริง เป็นรูปธรรม","คนที่มีจินตนาการ ความคิดสร้างสรรค์"],
            ["S","N","ใช่ ของเหล่านั้นไม่ค่อยมีผลอะไรกับฉันมาก","ไม่ ฉันชื่นชอบในแฟนตาซีและแนวคิดต่าง ๆ"],
            ["S","N","ข้อเท็จจริง","หลักการ"],
            #
            ["F","T","คุณเป็นคนมีความจริงใจ ซื่อตรงและน่าคบหา","คุณเป็นคนที่มีเหตุผล และสม่ำเสมอ"],
            ["T","F","ใช้ตรรกะเหตุผล\nมากกว่าความรู้สึกและความเห็นอกเห็นใจ","ใช้ความรู้สึกและความเห็นอกเห็นใจ\nมากกว่าตรรกะเหตุผล"],
            ["F","T","เห็นด้วย","ไม่เห็นด้วย"],
            ["T","F","โต้แย้งให้ชนะ สำคัญมากกว่า","ใส่ใจความรู้สึกผู้อื่น สำคัญมากกว่า"],
            ["F","T","ไม่ มีอารมณ์เสียบ้างมาจากความอึดอัดใจ","ใช่ เพราะต้องดูที่เหตุผลของการกระทำนั้น ๆ"],
            ["T","F","ใช่ บางคนก็จะซับซ้อนกว่าที่คิด","ไม่นะ เพราะเราสามารถเอาใจเขามาใส่ใจเราได้"],
            ["F","T","ปลอบประโลมเพื่อนที่ทุกใจ","เสนอทางออกในการแก้ปัญหา"],
            #
            ["J","P","งั้นเรามาวางแผนกันว่าจะทำอะไรบ้าง ไปวันไหน","ไปกันเลย ลุย!!"],
            ["P","J","เริ่มทำงานได้เลยโดยจัดการปัญหา\nไปพร้อม ๆ กันได้","วางแผนอย่างเป็นระบบก่อนเริ่มทำงาน\nเพื่อให้ความกดดันน้อยลง"],
            ["P","J","เห็นด้วย","ไม่เห็นด้วย"],
            ["J","P","ทำงานเป็นไปตามแผนอย่างระมัดระวัง รอบคอบ","ทำงานพร้อมรับมือกับเหตุการณ์\nไม่คาดคิดได้อยู่เสมอ"],
            ["J","P","ไปเที่ยว จัดปิกนิก ปาร์ตี้ ฯลฯ ล่วงหน้า","มีอิสระที่จะทำอะไรก็ได้ที่ดูสนุก เมื่อเวลามาถึง"],
            ["J","P","พึงพอใจที่สามารถวางแผนได้อย่างเหมาะสม","ไม่พอใจเล็กน้อยที่กำหนดไว้ตายตัว ไม่ยืดหยุ่น"],
            ["P","J","เป็นไปตามธรรมชาติ ตามสัญชาตญาณ","เป็นระบบระเบียบ ตามแนวปฏิบัติ"]    
]