import random
def get_MbtiQuizEN():
    return [["IE","Expend energy, enjoy groups or b. conserve energy, enjoy one-on-one"],
            ["IE","Are u out-going?"],
            ["IE","Are u out-going?"],
            ["IE","Are u out-going?"],
            ["IE","Are u out-going?"],
            ["IE","Are u out-going?"],
            ["IE","Are u out-going?"],
            
            ["NS","Which one you trust Present or Future?"],
            ["NS","Which one you trust Present or Future?"],
            ["NS","Which one you trust Present or Future?"],
            ["NS","Which one you trust Present or Future?"],
            ["NS","Which one you trust Present or Future?"],
            ["NS","Which one you trust Present or Future?"],
            ["NS","Which one you trust Present or Future?"],
            
            ["FT","When someone make mistake what you do to help?"],
            ["FT","When someone make mistake what you do to help?"],
            ["FT","When someone make mistake what you do to help?"],
            ["FT","When someone make mistake what you do to help?"],
            ["FT","When someone make mistake what you do to help?"],
            ["FT","When someone make mistake what you do to help?"],
            ["FT","When someone make mistake what you do to help?"],
            
            ["PJ","WHEN YOU GO SOMEWHERE FOR THE DAY, WOULD YOU RATHER?"],
            ["PJ","Have you wake-up instanly when alarm is clocking"],
            ["PJ","Have you wake-up instanly when alarm is clocking"],
            ["PJ","Have you wake-up instanly when alarm is clocking"],
            ["PJ","Have you wake-up instanly when alarm is clocking"],
            ["PJ","Have you wake-up instanly when alarm is clocking"],
            ["PJ","Have you wake-up instanly when alarm is clocking"]    
]

def get_MbtiQuizTH():
     return [["IE","คูณชื่นชอบการอยู่กับกลุ่มเพื่อนแบบไหน ?"],
            ["IE","ในหมู่เพื่อนของคุณ คุณคือคนแบบไหน ?"],
            ["IE","เมื่อคุณพบปะเพื่อนใหม่ คุณจะบอกความสนใจ\nหรืองานอดิเรกในตอน.."],
            ["IE","การแสดงออกทางอารมณ์ของคุณมักจะเป็นแบบไหน ?"],
            ["IE","คุณกังวลใจในการตกเป็นจุดสนใจของคนอื่น ๆ ?"],
            ["IE","รูปแบบของคุณเมื่ออยู่กับกลุ่มคนสนทนา เป็นแบบไหน ?"],
            ["IE","โดยปกติแล้วคุณมักจะ.."],
            #
            ["NS","ถ้าหากว่าวันนึงคุณได้เป็นอาจารย์ \nคุณอยากสอนนักเรียนแบบไหน ?"],
            ["NS","เมื่อคุณพบเจอกับปัญหา \nที่อาจจะมีหลาย ๆ คนประสบคุณจะแก้ไขปัญหาแบบไหน ?"],
            ["NS","คุณคิดว่าคุณนั้นเป็นคนมีเป็นมีแนวคิดและวิธีการแบบไหน ?"],
            ["NS","คุณอยากจะมีเพื่อนแบบไหนมากกว่ากันระหว่าง.."],
            ["NS","คุณมักจะเข้ากันได้ดีกับเพื่อที่มีลักษณะนิสัยแบบไหน ?"],
            ["NS","โดยปกติแล้วคุณชอบสังเกตอะไรจากคนอื่น ๆ ?"],
            ["NS","โดยส่วนใหญ่แล้ว คุณจะเลือกอะไรระหว่าง.."],
            #
            ["FT","คำชมของคนอื่นแบบไหน\nที่คุณรู้สึกว่าชื่นชอบมากกว่ากันระหว่าง.."],
            ["FT","โดยปกติแล้วคุณนั้นเป็นคนแบบไหน ระหว่าง.."],
            ["FT","ในการกระทำบางสิ่งบางอย่าง คุณมักจะปล่อยให้.."],
            ["FT","หากมีการโต้แย้งหรือถกเถียงกันในกลุ่ม คุณจะทำอย่างไร ?"],
            ["FT","แทบไม่เคยมีใครทำให้คุณอารมณ์เสียได้ ?"],
            ["FT","บ่อยครั้งเป็นเรื่องยากที่คุณจะเข้าใจความรู้สึกของผู้อื่น ?"],
            ["FT","สองสิ่งนี้อะไรดึงดูดคุณมากกว่ากัน ?"],
            #
            ["PJ","เมื่อคุณหรือเพื่อน ๆ ของคุณจะไปเที่ยวกันคุณจะทำอย่างไร ?"],
            ["PJ","หากว่าคุณมีจะทำงาน รูปแบบในการทำงานคุณจะเป็นแบบไหน ?"],
            ["PJ","ในการทำงานทั่วไปประจำวันของคุณนั้น.."],
            ["PJ","คุณจะประสบผลสำเร็จในการทำงานรูปแบบไหน ?"],
            ["PJ","คุณชอบที่จะ.."],
            ["PJ","เมื่อมีการนัดแนะกันล่วงหน้าเพื่อทำบางสิ่งในเวลาที่นัดแน่นอน \nคุณรู้สึกอย่างไร ?"],
            ["PJ","คุณจะเลือกอะไรในสองสิ่งนี้.."]    
]
    
def get_MbtiAnsTH():    
    return [["E","I","เพลิดเพลินกับเพื่อน ๆ กลุ่มใหญ่","เพลิดเพลินกับเพื่อน ๆ กลุ่มเล็ก"],
            ["I","E","คนสุดท้ายที่จะรู้เรื่องราวภายในกลุ่ม","รับรู้ข่าวสารของเพื่อนในกลุ่มอยู่ตลอด"],
            ["I","E","หลังจากที่ได้ทำความรู้จักจริง ๆ แล้ว","ตอนที่เจอกันเลย"],
            ["E","I","แสดงความรู้สึกออกมาอย่างเต็มที่","เก็บความรู้สึกไว้กับตัวเอง ไม่แสดงมากนัก"],
            ["E","I","ไม่เห็นด้วย","เห็นด้วย"],
            ["I","E","ยืนดูท่าทีอยู่หลัง ๆ และฟังวงสนทนาก่อน","เข้าร่วมวงสนทนาด้วยอย่างเหมาะสม"],
            ["I","E","ค่อนข้างเงียบและไม่สุงสิง","สามารถเข้ากับคนอื่น ๆ ได้ดี"],
            #
            ["S","N","หลักสูตรตามข้อเท็จจริงที่มีการพิสูจน์แล้ว","หลักสูตรที่เกี่ยวกับหลักการ แนวคิด ทฤษฎี"],
            ["N","S","คิดค้นวิธีการแก้ไขปัญหาขึ้นมาเอง","ด้วยวิธีที่มีการแก้ไขมาก่อนแล้วและเป็นที่ยอมรับ"],
            ["N","S","คนที่คิดนอกกรอบ สร้างสรรค์\nไม่ยึดติดตามหลักการ","คนที่นำหลักการมาปรับใช้ได้อย่างดี ปฏิบัติเก่ง"],
            ["N","S","คนที่มีความคิดสร้างสรรค์\nมักมาพร้อมกับอะไรใหม่ ๆ","คนที่มีเหตุผลบนพื้นฐานความเป็นจริง\nและสามารถเชื่อถือได้"],
            ["S","N","คนที่ยึดหลักความเป็นจริง เป็นรูปธรรม","คนที่มีจินตนาการ ความคิดสร้างสรรค์"],
            ["S","N","ดูว่าคนอื่นมีความสามารถ หรือประโยชน์อะไร","ดูว่าคนอื่นเห็นอะไร สนใจอะไร"],
            ["S","N","ข้อเท็จจริง","หลักการ"],
            #
            ["F","T","คุณเป็นคนมีความจริงใจ ซื่อตรงและน่าคบหา","คุณเป็นคนที่มีเหตุผล และสม่ำเสมอ"],
            ["T","F","ใช้ตรรกะเหตุผล\nมากกว่าความรู้สึกและความเห็นอกเห็นใจ","ใช้ความรู้สึกและความเห็นอกเห็นใจ\nมากกว่าเหตุผล"],
            ["F","T","ปล่อยให้จิตใจและความรู้สึกเหนี่ยวนำ\nความคิดและเหตุผล","ปล่อยให้ความคิดและเหตุผลเหนี่ยวนำ\nความรู้สึกและจิตใจ"],
            ["T","F","โต้แย้งให้ชนะสำคัญมากกว่า","ใส่ใจความรู้สึกผู้อื่นสำคัญมากกว่า"],
            ["F","T","ไม่ มีอารมณ์เสียบ้างมาจากความอึดอัดใจ","ใช่ เพราะต้องดูที่เหตุผลของการกระทำนั้น ๆ"],
            ["T","F","ก็ใช่ บางคนก็จะซับซ้อนกว่าที่คิด","ไม่นะ เพราะเราสามารถเอาใจเขามาใส่ใจเราได้"],
            ["F","T","การรับรู้สัมผัสต่าง ๆ","น่าเชื่อถือ โน้มใจ"],
            #
            ["J","P","งั้นเรามาวางแผนกันว่าจะทำอะไรบ้าง ไปวันไหน","ไปกันเลย ลุย!!"],
            ["P","J","เริ่มทำงานได้เลยโดยจัดการปัญหา\nไปพร้อม ๆ กันได้","วางแผนอย่างเป็นระบบก่อนเริ่มทำงาน"],
            ["P","J","ค่อนข้างชอบเหตุฉุกเฉินที่ทำให้คุณได้แก้ไข","มักจะวางแผนงานของคุณ\nโดยให้ความกดดันน้อยลง"],
            ["J","P","ทำงานเป็นไปตามแผนอย่างระมัดระวัง รอบคอบ","ทำงานพร้อมรับมือกับเหตุการณ์\nไม่คาดคิดได้อยู่เสมอ"],
            ["J","P","ไปเที่ยว จัดปิกนิก ปาร์ตี้ ฯลฯ ล่วงหน้า","มีอิสระที่จะทำอะไรก็ได้ที่ดูสนุก เมื่อเวลามาถึง"],
            ["J","P","พึงพอใจที่สามารถวางแผนได้อย่างเหมาะสม","ไม่พอใจเล็กน้อยที่กำหนดไว้ตายตัว ไม่ยืดหยุ่น"],
            ["P","J","เป็นไปตามธรรมชาติ ตามสัญชาตญาณ","เป็นระบบระเบียบ ตามแนวปฏิบัติ"]    
]

#randLst = random.sample(range(len(quiz)),len(quiz))